/*
لكل رقم في المصفوفة:

إذا كان للعدد جذر تربيعي صحيح (أي نتيجته عدد صحيح بدون كسور) ➜ ضع هذا الجذر بدل الرقم.

إذا لم يكن له جذر تربيعي صحيح ➜ ضع مربع العدد بدلًا منه.


استخدم map() لتطبيق العملية على كل عنصر في المصفوفة.

استخدم Math.sqrt(num) للحصول على الجذر التربيعي.

استخدم Number.isInteger() للتحقق إن كان الجذر عددًا صحيحًا.

إذا كان صحيحًا → أرجع الجذر.
إذا لم يكن صحيحًا → أرجع num * num.
*/
// مسالة تحويل الرقم الى جذره التربيعي اذا كان عدد صحيح وضربه ينفسه اذا لم يكن عدد صحيح
function squareOrSquareRoot(array) {
  return array.map((ele) => {
    let root = Math.sqrt(ele); // تحويل الرقم الى جذره التربيعي
    if (Number.isInteger(root) /* اذا كان الرقم صحيح */) {
      return root; // ارجعه لي كما هو
    } else {
      return ele * ele; // اذا لم يكن صحيح اضرب العدد بنفسه
    }
  });
}
console.log(squareOrSquareRoot([4, 3, 9, 7, 2, 1]));
